tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@14"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Tools for Multiple Arcade Machine Emulator
brew "rom-tools"
# Cross-shell prompt for astronauts
brew "starship"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Tools for building Android applications
cask "android-studio"
# Manage team projects and tasks
cask "asana"
# Two-factor authentication software
cask "authy"
# Scriptable scratchpad for developers
cask "boop"
# Web browser focusing on privacy
cask "brave-browser"
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Draw.io is free online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox-developer-edition"
# Typeface made for developers
cask "font-jetbrains-mono"
# Free and open-source image editor
cask "gimp"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Clipboard manager
cask "maccy"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Utility to move and zoom windows—on one display
cask "moom"
# Calculator and converter application
cask "numi"
# Collaboration platform for API development
cask "postman"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Instant messaging application focusing on security
cask "signal"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Accelerate", id: 1459809092
mas "AdGuard for Safari", id: 1440147259
mas "Affinity Designer", id: 824171161
mas "Amphetamine", id: 937984704
mas "Gifski", id: 1351639930
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Save to Raindrop.io", id: 1549370672
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
