tap "facebook/fb"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node@16"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Highly capable, feature-rich programming language
brew "perl"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tools for Multiple Arcade Machine Emulator
brew "rom-tools"
# Cross-shell prompt for astronauts
brew "starship"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Tools for building Android applications
cask "android-studio"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Collaborative team software
cask "figma"
# Typeface made for developers
cask "font-jetbrains-mono"
# Git interface focused on visual interaction
cask "gitup"
# Grammarly for desktop
cask "grammarly-desktop"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Clipboard manager
cask "maccy"
# Web browser
cask "microsoft-edge"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Calculator and converter application
cask "numi"
# Home media server
cask "plex-media-server"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Git client
cask "sublime-merge"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Accelerate", id: 1459809092
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Gifski", id: 1351639930
mas "Grammarly for Safari", id: 1462114288
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
